title: Privilage Escalation con sudo
id: a1b2c3d4-e5f6-g7h8-i9j0-k1l2m3o4p5q6
level: medium
author: Ezequiel D'Astolfo
date: 2025-07-02
description: |
 Detecta el uso del comando sudo, indicador de posible escalada de privilegios en sistemas Linux.
tags:
  - attack.privilege_escalation
  - attack.t1548
status: experimental
logsource:
  product: linux
  service: syslog
  category: process_creation
detection:
  selection:
    Message|contains: ['sudo', 'COMMAND=']
  exception_mngt:
    User: ['automation_user', 'backup_agent', 'svc_acct']
    Message|contains: 
     - 'ansible'
     - 'zabbix'  
  condition: selection and not 1 of exception_*
